In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/009.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

          0    1    2                        3                       4
0       NaN  NaN  NaN  Oxendine (R)  1,357,770  Drexinger (D)  713,324
1       NaN  NaN  NaN                    65.6%                   34.4%
2    County   PR   TP                      NaN                     NaN
3   APPLING   19   19                     2903                    1093
4  ATKINSON    6    6                      952                     459

In [5]:
df = df[3:]

In [6]:
df.head(5)

          0   1   2     3     4
3   APPLING  19  19  2903  1093
4  ATKINSON   6   6   952   459
5     BACON   7   7  1594   602
6     BAKER   7   7   504   423
7   BALDWIN  16  16  5835  3957

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

          0     3     4
3   APPLING  2903  1093
4  ATKINSON   952   459
5     BACON  1594   602
6     BAKER   504   423
7   BALDWIN  5835  3957

In [9]:
df.columns = ['county', 'John W. Oxendine', 'Guy Drexinger']

In [10]:
df.tail(5)

        county John W. Oxendine Guy Drexinger
157  WHITFIELD            11811          4441
158     WILCOX             1317           604
159     WILKES             1673           971
160  WILKINSON             1583          1180
161      WORTH             3680          1250

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

     county         candidate votes
0   APPLING  John W. Oxendine  2903
1  ATKINSON  John W. Oxendine   952
2     BACON  John W. Oxendine  1594
3     BAKER  John W. Oxendine   504
4   BALDWIN  John W. Oxendine  5835

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 318 entries, 0 to 317
Data columns (total 3 columns):
county       318 non-null object
candidate    318 non-null object
votes        318 non-null int64
dtypes: int64(1), object(2)
memory usage: 7.5+ KB

In [16]:
df['office'] = 'Commissioner Of Insurance'

In [17]:
df['district'] = ''

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'John W. Oxendine', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Guy Drexinger', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
Guy Drexinger     Democrat       713324
John W. Oxendine  Republican    1357770
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Commissioner Of Insurance,,Republican,John W. Oxendine,2903
1,ATKINSON,Commissioner Of Insurance,,Republican,John W. Oxendine,952
2,BACON,Commissioner Of Insurance,,Republican,John W. Oxendine,1594
3,BAKER,Commissioner Of Insurance,,Republican,John W. Oxendine,504
4,BALDWIN,Commissioner Of Insurance,,Republican,John W. Oxendine,5835

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')